In [5]:
import pandas as pd
df=pd.read_csv("Data.csv")
df.head()

   sno      name      id  marks
0    1  srinivas  180279    100
1    2   bharath  180303     99
2    3   praveen  180110    100
3    4     venky  180323     98
4    5      gopi  180157     76

In [6]:
pd.options.display.max_rows

60

In [8]:
pd.read_csv("Data.csv",names=["sno","name","id","marks"])

   sno      name      id  marks
0  sno      name      id  marks
1    1  srinivas  180279    100
2    2   bharath  180303     99
3    3   praveen  180110    100
4    4     venky  180323     98
5    5      gopi  180157     76
6    6    devraj  180123     77

In [10]:
pd.read_csv("Data.csv",skiprows=[0,2])

   1 srinivas  180279  100
0  3  praveen  180110  100
1  4    venky  180323   98
2  5     gopi  180157   76
3  6   devraj  180123   77

In [11]:
pd.read_csv("Data.csv",header=None)

     0         1       2      3
0  sno      name      id  marks
1    1  srinivas  180279    100
2    2   bharath  180303     99
3    3   praveen  180110    100
4    4     venky  180323     98
5    5      gopi  180157     76
6    6    devraj  180123     77

In [13]:
df.head(6)

   sno      name      id  marks
0    1  srinivas  180279    100
1    2   bharath  180303     99
2    3   praveen  180110    100
3    4     venky  180323     98
4    5      gopi  180157     76
5    6    devraj  180123     77

In [14]:
df.tail()

   sno     name      id  marks
1    2  bharath  180303     99
2    3  praveen  180110    100
3    4    venky  180323     98
4    5     gopi  180157     76
5    6   devraj  180123     77

In [15]:
df.tail(4)

   sno     name      id  marks
2    3  praveen  180110    100
3    4    venky  180323     98
4    5     gopi  180157     76
5    6   devraj  180123     77

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sno     6 non-null      int64
 1   name    6 non-null      object
 2   id      6 non-null      int64
 3   marks   6 non-null      int64
dtypes: int64(3), object(1)
memory usage: 320.0+ bytes

In [27]:
data=pd.read_csv("Book1.csv")
data

    student section      id
0  srinivas      2e  180279
1   praveen      2e  180110
2     venky      2c  180323
3      gopi      2a  180157
4    devraj      2b  180123

In [28]:
data["id"]>500

0    True
1    True
2    True
3    True
4    True
Name: id, dtype: bool

In [30]:
data["id"].sum()

900992

In [31]:
data["id"].max()

180323

In [32]:
data["id"].min()

180110

In [33]:
data["id"].count()

5

In [34]:
data.size

15

In [35]:
data.describe()

                  id
count       5.000000
mean   180198.400000
std        96.482123
min    180110.000000
25%    180123.000000
50%    180157.000000
75%    180279.000000
max    180323.000000